---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures
source: html/e4c9eda0-a77b-f556-8d7a-2e028a907fb4.htm
---
# BuiltInFailures.AutoJoinFailures Properties

Can't make the expected join because of editability and design option restrictions.